'''
Ось декілька ключових можливостей модуля sys:

sys.argv - список аргументів командного рядка, переданих скрипту Python. Елемент argv[0] є ім'ям скрипту, а інші елементи – це додаткові аргументи командного рядка.
sys.exit() - функція виходу з Python. Ви можете передати числовий аргумент, що стане статусом виходу програми. Прийнято, що аргумент 0 означає успішне завершення, а ненульові значення вказують на помилку.
sys.path - список рядків, який визначає шлях пошуку інтерпретатора для модулів. Ви можете модифікувати цей список, щоб додати власні шляхи для пошуку модулів.
sys.version - рядок, що містить інформацію про версію Python, яка використовується.
sys.platform - рядок, що вказує на ім'я платформи, на якій виконується Python (наприклад, 'linux' для Linux, 'win32' для Windows).
sys.modules - словник, який містить завантажені модулі. Ключі – це назви модулів, а значення – це об'єкти модулів.
'''

import sys
import os

print(sys.modules["os"])

print()

print(sys.builtin_module_names)

print()
print()
for arg in sys.argv:
    print(arg)
